name: "ResNet_joint_training"
#small domain
layer {
  name: "data"
  type: "RefinedBoostedJointTrainingData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    #mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_data_param {
    #source: "/home/wfge/image_database/flowers_small_domain_train_aug.txt"
    batch_size: 18
    new_height: 256
    new_width: 256
    is_color: true
    #shuffle: true
    root_folder: "/home/wfge/image_database/"
  }
  boosted_joint_training_data_param {
    source_domain_image_label_path: "/home/wfge/image_database/MIT67/mit67_train_retrieval_results_global_label_source_label_dis.txt"
    target_domain_image_label_path: "/home/wfge/image_database/MIT67/mit67_train_global_label_target_label_dis_full_path.txt"
    source_domain_sample_num: 866302
    source_domain_class_num: 1000
    target_domain_sample_num: 219760
    target_domain_class_num: 67
    target_domain_sample_weight_path: "examples/cvpr2017/mit67/joint_training_with_selected_samples/first_round/sampling_level_equal.txt"
    target_nn_configuration_path: "/home/wfge/image_database/MIT67/mit67_train_retrieval_nearest_neighbor_image_idx_dis.txt"
    target_domain_train_num: 5360
    target_domain_val_num: 0
    target_nn_in_source_num: 5000
    base_selected_nn_num: 300
    target_val_label_path: "/home/wfge/image_database/MIT67/mit67_train_idx.txt"
    target_domain_train_val_num: 5360
    highest_sample_level: 10  
    least_sample_per_class: 0	
  }
}

layer {
  name: "split_label"
  type: "SplitData"
  bottom: "label"
  top: "target_label"
  top: "source_label"
  split_data_param{
    split_num: 9
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "data"
  type: "ImageData"
  top: "data_target"
  top: "target_label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: true
    crop_size: 224
    #mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_data_param {
    source: "/home/wfge/image_database/MIT67/MIT67_test_list.txt"
    batch_size: 2
    new_height: 256
    new_width: 256
    is_color: true
    shuffle: false
    root_folder: "/home/wfge/image_database/MIT67/Images/"
  }
}

layer {
  name: "data_source"
  type: "ImageData"
  top: "data_source"
  top: "source_label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: true
    crop_size: 224
    #mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_data_param {
    source: "/home/wfge/image_database/flowers_alexnet_color_conv11_5_2000.txt"
    batch_size: 1
    new_height: 256
    new_width: 256
    is_color: true
    shuffle: true
    root_folder: "/home/wfge/image_database/"
  }
}

layer {
  name: "merge_data"
  type: "MergeData"
  bottom: "data_target"
  bottom: "data_source"
  top: "data"
  include {
    phase: TEST
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale_conv1"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn2a_branch2a"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale2a_branch2a"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu2a_branch2a"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
}

layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn2a_branch2b"
  type: "BatchNorm"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale2a_branch2b"
  type: "Scale"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu2a_branch2b"
  type: "ReLU"
  top: "res2a_branch2b"
  bottom: "res2a_branch2b"
}

layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
	num_output: 256
	kernel_size: 1
	pad: 0
	stride: 1
	weight_filler {
      type: "xavier"
    }
	bias_term: false
  }
}

layer {
  name: "res2a"
  type: "Residual"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a_left"
  top: "res2a_right"
}

layer {
  name: "bn2a"
  type: "BatchNorm"
  bottom: "res2a_left"
  top: "res2a_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale2a"
  type: "Scale"
  bottom: "res2a_left"
  top: "res2a_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu2a"
  type: "ReLU"
  bottom: "res2a_left"
  top: "res2a_left" 
}

layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a_left"
  top: "res2b_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn2b_branch2a"
  type: "BatchNorm"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale2b_branch2a"
  type: "Scale"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu2b_branch2a"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
}

layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn2b_branch2b"
  type: "BatchNorm"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale2b_branch2b"
  type: "Scale"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  scale_param {
 	bias_term: true
  }
}

layer {
  name: "relu2b_branch2b"
  type: "ReLU"
  top: "res2b_branch2b"
  bottom: "res2b_branch2b"
}

layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res2b"
  type: "Residual"
  bottom: "res2b_branch2c"
  bottom: "res2a_right"
  top: "res2b_left"
  top: "res2b_right"
}

layer {
  name: "bn2b"
  type: "BatchNorm"
  bottom: "res2b_left"
  top: "res2b_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale2b"
  type: "Scale"
  bottom: "res2b_left"
  top: "res2b_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b_left"
  top: "res2b_left"
}

layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b_left"
  top: "res2c_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn2c_branch2a"
  type: "BatchNorm"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale2c_branch2a"
  type: "Scale"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu2c_branch2a"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
}

layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn2c_branch2b"
  type: "BatchNorm"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale2c_branch2b"
  type: "Scale"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  scale_param {
 	bias_term: true
  }
}

layer {
  name: "res2c_branch2b_relu"
  type: "ReLU"
  top: "res2c_branch2b"
  bottom: "res2c_branch2b"
}

layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "res2c_branch2b"
  top: "res2c_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res2c"
  type: "Residual"
  bottom: "res2c_branch2c"
  bottom: "res2b_right"
  top: "res2c"
}

layer {
  name: "bn2c"
  type: "BatchNorm"
  bottom: "res2c"
  top: "res2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale2c"
  type: "Scale"
  bottom: "res2c"
  top: "res2c"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res2c_relu"
  type: "ReLU"
  bottom: "res2c"
  top: "res2c"
}

layer {
  name: "res3a_branch1"
  type: "Convolution"
  bottom: "res2c"
  top: "res3a_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res3a_branch2a"
  type: "Convolution"
  bottom: "res2c"
  top: "res3a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3a_branch2a"
  type: "BatchNorm"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3a_branch2a"
  type: "Scale"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu3a_branch2a"
  type: "ReLU"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
}

layer {
  name: "res3a_branch2b"
  type: "Convolution"
  bottom: "res3a_branch2a"
  top: "res3a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3a_branch2b"
  type: "BatchNorm"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3a_branch2b"
  type: "Scale"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu3a_branch2b"
  type: "ReLU"
  top: "res3a_branch2b"
  bottom: "res3a_branch2b"
}

layer {
  name: "res3a_branch2c"
  type: "Convolution"
  bottom: "res3a_branch2b"
  top: "res3a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res3a"
  type: "Residual"
  bottom: "res3a_branch1"
  bottom: "res3a_branch2c"
  top: "res3a_left"
  top: "res3a_right"
}
layer {
  name: "bn3a"
  type: "BatchNorm"
  bottom: "res3a_left"
  top: "res3a_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3a"
  type: "Scale"
  bottom: "res3a_left"
  top: "res3a_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res3a_relu"
  type: "ReLU"
  bottom: "res3a_left"
  top: "res3a_left"
}

layer {
  name: "res3b1_branch2a"
  type: "Convolution"
  bottom: "res3a_left"
  top: "res3b1_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b1_branch2a"
  type: "BatchNorm"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b1_branch2a"
  type: "Scale"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu3b1_branch2a"
  type: "ReLU"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2a"
}

layer {
  name: "res3b1_branch2b"
  type: "Convolution"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b1_branch2b"
  type: "BatchNorm"
  bottom: "res3b1_branch2b"
  top: "res3b1_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b1_branch2b"
  type: "Scale"
  bottom: "res3b1_branch2b"
  top: "res3b1_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu3b1_branch2b"
  type: "ReLU"
  top: "res3b1_branch2b"
  bottom: "res3b1_branch2b"
}

layer {
  name: "res3b1_branch2c"
  type: "Convolution"
  bottom: "res3b1_branch2b"
  top: "res3b1_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res3b1"
  type: "Residual"
  bottom: "res3b1_branch2c"
  bottom: "res3a_right"
  top: "res3b1_left"
  top: "res3b1_right"
}

layer {
  name: "bn3b1"
  type: "BatchNorm"
  bottom: "res3b1_left"
  top: "res3b1_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b1"
  type: "Scale"
  bottom: "res3b1_left"
  top: "res3b1_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res3b1_relu"
  type: "ReLU"
  bottom: "res3b1_left"
  top: "res3b1_left"
}

layer {
  name: "res3b2_branch2a"
  type: "Convolution"
  bottom: "res3b1_left"
  top: "res3b2_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b2_branch2a"
  type: "BatchNorm"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b2_branch2a"
  type: "Scale"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu3b2_branch2a"
  type: "ReLU"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2a"
}

layer {
  name: "res3b2_branch2b"
  type: "Convolution"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b2_branch2b"
  type: "BatchNorm"
  bottom: "res3b2_branch2b"
  top: "res3b2_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b2_branch2b"
  type: "Scale"
  bottom: "res3b2_branch2b"
  top: "res3b2_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu3b2_branch2b"
  type: "ReLU"
  top: "res3b2_branch2b"
  bottom: "res3b2_branch2b"
}

layer {
  name: "res3b2_branch2c"
  type: "Convolution"
  bottom: "res3b2_branch2b"
  top: "res3b2_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res3b2"
  type: "Residual"
  bottom: "res3b2_branch2c"
  bottom: "res3b1_right"
  top: "res3b2_left"
  top: "res3b2_right"
}

layer {
  name: "bn3b2"
  type: "BatchNorm"
  bottom: "res3b2_left"
  top: "res3b2_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b2"
  type: "Scale"
  bottom: "res3b2_left"
  top: "res3b2_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu3b2"
  type: "ReLU"
  bottom: "res3b2_left"
  top: "res3b2_left"
}

layer {
  name: "res3b3_branch2a"
  type: "Convolution"
  bottom: "res3b2_left"
  top: "res3b3_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b3_branch2a"
  type: "BatchNorm"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b3_branch2a"
  type: "Scale"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu3b3_branch2a"
  type: "ReLU"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2a"
}

layer {
  name: "res3b3_branch2b"
  type: "Convolution"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b3_branch2b"
  type: "BatchNorm"
  bottom: "res3b3_branch2b"
  top: "res3b3_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b3_branch2b"
  type: "Scale"
  bottom: "res3b3_branch2b"
  top: "res3b3_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu3b3_branch2b"
  type: "ReLU"
  top: "res3b3_branch2b"
  bottom: "res3b3_branch2b"
}

layer {
  name: "res3b3_branch2c"
  type: "Convolution"
  bottom: "res3b3_branch2b"
  top: "res3b3_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res3b3"
  type: "Residual"
  bottom: "res3b3_branch2c"
  bottom: "res3b2_right"
  top: "res3b3_left"
  top: "res3b3_right"
}

layer {
  name: "bn3b3"
  type: "BatchNorm"
  bottom: "res3b3_left"
  top: "res3b3_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b3"
  type: "Scale"
  bottom: "res3b3_left"
  top: "res3b3_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu3b3"
  type: "ReLU"
  bottom: "res3b3_left"
  top: "res3b3_left"
}

layer {
  name: "res3b4_branch2a"
  type: "Convolution"
  bottom: "res3b3_left"
  top: "res3b4_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b4_branch2a"
  type: "BatchNorm"
  bottom: "res3b4_branch2a"
  top: "res3b4_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b4_branch2a"
  type: "Scale"
  bottom: "res3b4_branch2a"
  top: "res3b4_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu3b4_branch2a"
  type: "ReLU"
  bottom: "res3b4_branch2a"
  top: "res3b4_branch2a"
}

layer {
  name: "res3b4_branch2b"
  type: "Convolution"
  bottom: "res3b4_branch2a"
  top: "res3b4_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b4_branch2b"
  type: "BatchNorm"
  bottom: "res3b4_branch2b"
  top: "res3b4_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b4_branch2b"
  type: "Scale"
  bottom: "res3b4_branch2b"
  top: "res3b4_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu3b4_branch2b"
  type: "ReLU"
  top: "res3b4_branch2b"
  bottom: "res3b4_branch2b"
}

layer {
  name: "res3b4_branch2c"
  type: "Convolution"
  bottom: "res3b4_branch2b"
  top: "res3b4_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res3b4"
  type: "Residual"
  bottom: "res3b4_branch2c"
  bottom: "res3b3_right"
  top: "res3b4_left"
  top: "res3b4_right"
}

layer {
  name: "bn3b4"
  type: "BatchNorm"
  bottom: "res3b4_left"
  top: "res3b4_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b4"
  type: "Scale"
  bottom: "res3b4_left"
  top: "res3b4_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res3b4_relu"
  type: "ReLU"
  bottom: "res3b4_left"
  top: "res3b4_left"
}

layer {
  name: "res3b5_branch2a"
  type: "Convolution"
  bottom: "res3b4_left"
  top: "res3b5_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b5_branch2a"
  type: "BatchNorm"
  bottom: "res3b5_branch2a"
  top: "res3b5_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b5_branch2a"
  type: "Scale"
  bottom: "res3b5_branch2a"
  top: "res3b5_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu3b5_branch2a"
  type: "ReLU"
  bottom: "res3b5_branch2a"
  top: "res3b5_branch2a"
}

layer {
  name: "res3b5_branch2b"
  type: "Convolution"
  bottom: "res3b5_branch2a"
  top: "res3b5_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b5_branch2b"
  type: "BatchNorm"
  bottom: "res3b5_branch2b"
  top: "res3b5_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b5_branch2b"
  type: "Scale"
  bottom: "res3b5_branch2b"
  top: "res3b5_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu3b5_branch2b"
  type: "ReLU"
  top: "res3b5_branch2b"
  bottom: "res3b5_branch2b"
}

layer {
  name: "res3b5_branch2c"
  type: "Convolution"
  bottom: "res3b5_branch2b"
  top: "res3b5_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res3b5"
  type: "Residual"
  bottom: "res3b5_branch2c"
  bottom: "res3b4_right"
  top: "res3b5_left"
  top: "res3b5_right"
}

layer {
  name: "bn3b5"
  type: "BatchNorm"
  bottom: "res3b5_left"
  top: "res3b5_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b5"
  type: "Scale"
  bottom: "res3b5_left"
  top: "res3b5_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res3b5_relu"
  type: "ReLU"
  bottom: "res3b5_left"
  top: "res3b5_left"
}

layer {
  name: "res3b6_branch2a"
  type: "Convolution"
  bottom: "res3b5_left"
  top: "res3b6_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b6_branch2a"
  type: "BatchNorm"
  bottom: "res3b6_branch2a"
  top: "res3b6_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b6_branch2a"
  type: "Scale"
  bottom: "res3b6_branch2a"
  top: "res3b6_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu3b6_branch2a"
  type: "ReLU"
  bottom: "res3b6_branch2a"
  top: "res3b6_branch2a"
}

layer {
  name: "res3b6_branch2b"
  type: "Convolution"
  bottom: "res3b6_branch2a"
  top: "res3b6_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b6_branch2b"
  type: "BatchNorm"
  bottom: "res3b6_branch2b"
  top: "res3b6_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b6_branch2b"
  type: "Scale"
  bottom: "res3b6_branch2b"
  top: "res3b6_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu3b6_branch2b"
  type: "ReLU"
  top: "res3b6_branch2b"
  bottom: "res3b6_branch2b"
}

layer {
  name: "res3b6_branch2c"
  type: "Convolution"
  bottom: "res3b6_branch2b"
  top: "res3b6_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res3b6"
  type: "Residual"
  bottom: "res3b6_branch2c"
  bottom: "res3b5_right"
  top: "res3b6_left"
  top: "res3b6_right"
}

layer {
  name: "bn3b6"
  type: "BatchNorm"
  bottom: "res3b6_left"
  top: "res3b6_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b6"
  type: "Scale"
  bottom: "res3b6_left"
  top: "res3b6_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res3b6_relu"
  type: "ReLU"
  bottom: "res3b6_left"
  top: "res3b6_left"
}

layer {
  name: "res3b7_branch2a"
  type: "Convolution"
  bottom: "res3b6_left"
  top: "res3b7_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b7_branch2a"
  type: "BatchNorm"
  bottom: "res3b7_branch2a"
  top: "res3b7_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b7_branch2a"
  type: "Scale"
  bottom: "res3b7_branch2a"
  top: "res3b7_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu3b7_branch2a"
  type: "ReLU"
  bottom: "res3b7_branch2a"
  top: "res3b7_branch2a"
}

layer {
  name: "res3b7_branch2b"
  type: "Convolution"
  bottom: "res3b7_branch2a"
  top: "res3b7_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn3b7_branch2b"
  type: "BatchNorm"
  bottom: "res3b7_branch2b"
  top: "res3b7_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b7_branch2b"
  type: "Scale"
  bottom: "res3b7_branch2b"
  top: "res3b7_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu3b7_branch2b"
  type: "ReLU"
  top: "res3b7_branch2b"
  bottom: "res3b7_branch2b"
}

layer {
  name: "res3b7_branch2c"
  type: "Convolution"
  bottom: "res3b7_branch2b"
  top: "res3b7_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res3b7"
  type: "Residual"
  bottom: "res3b7_branch2c"
  bottom: "res3b6_right"
  top: "res3b7"
}

layer {
  name: "bn3b7"
  type: "BatchNorm"
  bottom: "res3b7"
  top: "res3b7"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale3b7"
  type: "Scale"
  bottom: "res3b7"
  top: "res3b7"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res3b7_relu"
  type: "ReLU"
  bottom: "res3b7"
  top: "res3b7"
}

layer {
  name: "res4a_branch1"
  type: "Convolution"
  bottom: "res3b7"
  top: "res4a_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res4a_branch2a"
  type: "Convolution"
  bottom: "res3b7"
  top: "res4a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4a_branch2a"
  type: "BatchNorm"
  bottom: "res4a_branch2a"
  top: "res4a_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4a_branch2a"
  type: "Scale"
  bottom: "res4a_branch2a"
  top: "res4a_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu4a_branch2a"
  type: "ReLU"
  bottom: "res4a_branch2a"
  top: "res4a_branch2a"
}

layer {
  name: "res4a_branch2b"
  type: "Convolution"
  bottom: "res4a_branch2a"
  top: "res4a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4a_branch2b"
  type: "BatchNorm"
  bottom: "res4a_branch2b"
  top: "res4a_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4a_branch2b"
  type: "Scale"
  bottom: "res4a_branch2b"
  top: "res4a_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu4a_branch2b"
  type: "ReLU"
  top: "res4a_branch2b"
  bottom: "res4a_branch2b"
}

layer {
  name: "res4a_branch2c"
  type: "Convolution"
  bottom: "res4a_branch2b"
  top: "res4a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res4a"
  type: "Residual"
  bottom: "res4a_branch1"
  bottom: "res4a_branch2c"
  top: "res4a_left"
  top: "res4a_right"
}

layer {
  name: "bn4a"
  type: "BatchNorm"
  bottom: "res4a_left"
  top: "res4a_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4a"
  type: "Scale"
  bottom: "res4a_left"
  top: "res4a_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res4a_relu"
  type: "ReLU"
  bottom: "res4a_left"
  top: "res4a_left"
}

layer {
  name: "res4b1_branch2a"
  type: "Convolution"
  bottom: "res4a_left"
  top: "res4b1_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b1_branch2a"
  type: "BatchNorm"
  bottom: "res4b1_branch2a"
  top: "res4b1_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b1_branch2a"
  type: "Scale"
  bottom: "res4b1_branch2a"
  top: "res4b1_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu4b1_branch2a"
  type: "ReLU"
  bottom: "res4b1_branch2a"
  top: "res4b1_branch2a"
}

layer {
  name: "res4b1_branch2b"
  type: "Convolution"
  bottom: "res4b1_branch2a"
  top: "res4b1_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b1_branch2b"
  type: "BatchNorm"
  bottom: "res4b1_branch2b"
  top: "res4b1_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b1_branch2b"
  type: "Scale"
  bottom: "res4b1_branch2b"
  top: "res4b1_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu4b1_branch2b"
  type: "ReLU"
  top: "res4b1_branch2b"
  bottom: "res4b1_branch2b"
}

layer {
  name: "res4b1_branch2c"
  type: "Convolution"
  bottom: "res4b1_branch2b"
  top: "res4b1_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res4b1"
  type: "Residual"
  bottom: "res4b1_branch2c"
  bottom: "res4a_right"
  top: "res4b1_left"
  top: "res4b1_right"
}

layer {
  name: "bn4b1"
  type: "BatchNorm"
  bottom: "res4b1_left"
  top: "res4b1_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b1"
  type: "Scale"
  bottom: "res4b1_left"
  top: "res4b1_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res4b1_relu"
  type: "ReLU"
  bottom: "res4b1_left"
  top: "res4b1_left"
}

layer {
  name: "res4b2_branch2a"
  type: "Convolution"
  bottom: "res4b1_left"
  top: "res4b2_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b2_branch2a"
  type: "BatchNorm"
  bottom: "res4b2_branch2a"
  top: "res4b2_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b2_branch2a"
  type: "Scale"
  bottom: "res4b2_branch2a"
  top: "res4b2_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu4b2_branch2a"
  type: "ReLU"
  bottom: "res4b2_branch2a"
  top: "res4b2_branch2a"
}

layer {
  name: "res4b2_branch2b"
  type: "Convolution"
  bottom: "res4b2_branch2a"
  top: "res4b2_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b2_branch2b"
  type: "BatchNorm"
  bottom: "res4b2_branch2b"
  top: "res4b2_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b2_branch2b"
  type: "Scale"
  bottom: "res4b2_branch2b"
  top: "res4b2_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu4b2_branch2b"
  type: "ReLU"
  top: "res4b2_branch2b"
  bottom: "res4b2_branch2b"
}

layer {
  name: "res4b2_branch2c"
  type: "Convolution"
  bottom: "res4b2_branch2b"
  top: "res4b2_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res4b2"
  type: "Residual"
  bottom: "res4b2_branch2c"
  bottom: "res4b1_right"
  top: "res4b2_left"
  top: "res4b2_right"
}

layer {
  name: "bn4b2"
  type: "BatchNorm"
  bottom: "res4b2_left"
  top: "res4b2_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b2"
  type: "Scale"
  bottom: "res4b2_left"
  top: "res4b2_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res4b2_relu"
  type: "ReLU"
  bottom: "res4b2_left"
  top: "res4b2_left"
}

layer {
  name: "res4b3_branch2a"
  type: "Convolution"
  bottom: "res4b2_left"
  top: "res4b3_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b3_branch2a"
  type: "BatchNorm"
  bottom: "res4b3_branch2a"
  top: "res4b3_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b3_branch2a"
  type: "Scale"
  bottom: "res4b3_branch2a"
  top: "res4b3_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu4b3_branch2a"
  type: "ReLU"
  bottom: "res4b3_branch2a"
  top: "res4b3_branch2a"
}

layer {
  name: "res4b3_branch2b"
  type: "Convolution"
  bottom: "res4b3_branch2a"
  top: "res4b3_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b3_branch2b"
  type: "BatchNorm"
  bottom: "res4b3_branch2b"
  top: "res4b3_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b3_branch2b"
  type: "Scale"
  bottom: "res4b3_branch2b"
  top: "res4b3_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu4b3_branch2b"
  type: "ReLU"
  top: "res4b3_branch2b"
  bottom: "res4b3_branch2b"
}

layer {
  name: "res4b3_branch2c"
  type: "Convolution"
  bottom: "res4b3_branch2b"
  top: "res4b3_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res4b3"
  type: "Residual"
  bottom: "res4b3_branch2c"
  bottom: "res4b2_right"
  top: "res4b3_left"
  top: "res4b3_right"
}

layer {
  name: "bn4b3"
  type: "BatchNorm"
  bottom: "res4b3_left"
  top: "res4b3_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b3"
  type: "Scale"
  bottom: "res4b3_left"
  top: "res4b3_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res4b3_relu"
  type: "ReLU"
  bottom: "res4b3_left"
  top: "res4b3_left"
}

layer {
  name: "res4b4_branch2a"
  type: "Convolution"
  bottom: "res4b3_left"
  top: "res4b4_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b4_branch2a"
  type: "BatchNorm"
  bottom: "res4b4_branch2a"
  top: "res4b4_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b4_branch2a"
  type: "Scale"
  bottom: "res4b4_branch2a"
  top: "res4b4_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu4b4_branch2a"
  type: "ReLU"
  bottom: "res4b4_branch2a"
  top: "res4b4_branch2a"
}

layer {
  name: "res4b4_branch2b"
  type: "Convolution"
  bottom: "res4b4_branch2a"
  top: "res4b4_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b4_branch2b"
  type: "BatchNorm"
  bottom: "res4b4_branch2b"
  top: "res4b4_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b4_branch2b"
  type: "Scale"
  bottom: "res4b4_branch2b"
  top: "res4b4_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu4b4_branch2b"
  type: "ReLU"
  top: "res4b4_branch2b"
  bottom: "res4b4_branch2b"
}

layer {
  name: "res4b4_branch2c"
  type: "Convolution"
  bottom: "res4b4_branch2b"
  top: "res4b4_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res4b4"
  type: "Residual"
  bottom: "res4b4_branch2c"
  bottom: "res4b3_right"
  top: "res4b4_left"
  top: "res4b4_right"
}

layer {
  name: "bn4b4"
  type: "BatchNorm"
  bottom: "res4b4_left"
  top: "res4b4_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b4"
  type: "Scale"
  bottom: "res4b4_left"
  top: "res4b4_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res4b4_relu"
  type: "ReLU"
  bottom: "res4b4_left"
  top: "res4b4_left"
}

layer {
  name: "res4b5_branch2a"
  type: "Convolution"
  bottom: "res4b4_left"
  top: "res4b5_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b5_branch2a"
  type: "BatchNorm"
  bottom: "res4b5_branch2a"
  top: "res4b5_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b5_branch2a"
  type: "Scale"
  bottom: "res4b5_branch2a"
  top: "res4b5_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu4b5_branch2a"
  type: "ReLU"
  bottom: "res4b5_branch2a"
  top: "res4b5_branch2a"
}

layer {
  name: "res4b5_branch2b"
  type: "Convolution"
  bottom: "res4b5_branch2a"
  top: "res4b5_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b5_branch2b"
  type: "BatchNorm"
  bottom: "res4b5_branch2b"
  top: "res4b5_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b5_branch2b"
  type: "Scale"
  bottom: "res4b5_branch2b"
  top: "res4b5_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu4b5_branch2b"
  type: "ReLU"
  top: "res4b5_branch2b"
  bottom: "res4b5_branch2b"
}

layer {
  name: "res4b5_branch2c"
  type: "Convolution"
  bottom: "res4b5_branch2b"
  top: "res4b5_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res4b5"
  type: "Residual"
  bottom: "res4b5_branch2c"
  bottom: "res4b4_right"
  top: "res4b5_left"
  top: "res4b5_right"
}

layer {
  name: "bn4b5"
  type: "BatchNorm"
  bottom: "res4b5_left"
  top: "res4b5_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b5"
  type: "Scale"
  bottom: "res4b5_left"
  top: "res4b5_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res4b5_relu"
  type: "ReLU"
  bottom: "res4b5_left"
  top: "res4b5_left"
}

layer {
  name: "res4b6_branch2a"
  type: "Convolution"
  bottom: "res4b5_left"
  top: "res4b6_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b6_branch2a"
  type: "BatchNorm"
  bottom: "res4b6_branch2a"
  top: "res4b6_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b6_branch2a"
  type: "Scale"
  bottom: "res4b6_branch2a"
  top: "res4b6_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu4b6_branch2a"
  type: "ReLU"
  bottom: "res4b6_branch2a"
  top: "res4b6_branch2a"
}

layer {
  name: "res4b6_branch2b"
  type: "Convolution"
  bottom: "res4b6_branch2a"
  top: "res4b6_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b6_branch2b"
  type: "BatchNorm"
  bottom: "res4b6_branch2b"
  top: "res4b6_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b6_branch2b"
  type: "Scale"
  bottom: "res4b6_branch2b"
  top: "res4b6_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu4b6_branch2b"
  type: "ReLU"
  top: "res4b6_branch2b"
  bottom: "res4b6_branch2b"
}

layer {
  name: "res4b6_branch2c"
  type: "Convolution"
  bottom: "res4b6_branch2b"
  top: "res4b6_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res4b6"
  type: "Residual"
  bottom: "res4b6_branch2c"
  bottom: "res4b5_right"
  top: "res4b6_left"
  top: "res4b6_right"
}

layer {
  name: "bn4b6"
  type: "BatchNorm"
  bottom: "res4b6_left"
  top: "res4b6_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b6"
  type: "Scale"
  bottom: "res4b6_left"
  top: "res4b6_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res4b6_relu"
  type: "ReLU"
  bottom: "res4b6_left"
  top: "res4b6_left"
}

layer {
  name: "res4b7_branch2a"
  type: "Convolution"
  bottom: "res4b6_left"
  top: "res4b7_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b7_branch2a"
  type: "BatchNorm"
  bottom: "res4b7_branch2a"
  top: "res4b7_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b7_branch2a"
  type: "Scale"
  bottom: "res4b7_branch2a"
  top: "res4b7_branch2a"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu4b7_branch2a"
  type: "ReLU"
  bottom: "res4b7_branch2a"
  top: "res4b7_branch2a"
}

layer {
  name: "res4b7_branch2b"
  type: "Convolution"
  bottom: "res4b7_branch2a"
  top: "res4b7_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "bn4b7_branch2b"
  type: "BatchNorm"
  bottom: "res4b7_branch2b"
  top: "res4b7_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b7_branch2b"
  type: "Scale"
  bottom: "res4b7_branch2b"
  top: "res4b7_branch2b"
  scale_param {
	bias_term: true
  }
}

layer {
  name: "relu4b7_branch2b"
  type: "ReLU"
  top: "res4b7_branch2b"
  bottom: "res4b7_branch2b"
}

layer {
  name: "res4b7_branch2c"
  type: "Convolution"
  bottom: "res4b7_branch2b"
  top: "res4b7_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}

layer {
  name: "res4b7"
  type: "Residual"
  bottom: "res4b7_branch2c"
  bottom: "res4b6_right"
  top: "res4b7_left"
  top: "res4b7_right"
}

layer {
  name: "bn4b7"
  type: "BatchNorm"
  bottom: "res4b7_left"
  top: "res4b7_left"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "scale4b7"
  type: "Scale"
  bottom: "res4b7_left"
  top: "res4b7_left"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "res4b7_relu"
  type: "ReLU"
  bottom: "res4b7_left"
  top: "res4b7_left"
}

layer {
  name: "res4b8_branch2a"
  type: "Convolution"
  bottom: "res4b7_left"
  top: "res4b8_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
